Enums/ТипыЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссионныйТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолуфабрикатДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНаХраненииСПравомПродажи</Name>
					<Comment>Товар, принятый на ответственное хранение с целью дальнейшей продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНаХраненииСПравомПродажиПереданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйТоварВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйТоварПоНеотфактурованнойПоставке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгентскаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТоварТребующийПодтвержденияВыпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТоварПереданный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗапасов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает типы запасов, по которым не требуется контролировать остатки товаров организаций
// 
// Возвращаемое значение:
//  Массив - массив элементов типа ПеречислениеСсылка.ТипыЗапасов
//
Функция НеконтролируемыеПоТоварамОрганизацииТипыЗапасов() Экспорт
	
	ТипыЗапасов = Новый Массив;
	ТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.СобственныйТоварВПути);
	ТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке);
	ТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.Услуга);
	ТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.АгентскаяУслуга);
	ТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажиПереданный);
	
	Возврат ТипыЗапасов;
	
КонецФункции

// Возвращает типы запасов, которые нужно контролировать на остатках организаций.
// 
// Возвращаемое значение:
//  Массив - массив элементов типа ПеречислениеСсылка.ТипыЗапасов
//
Функция КонтролируемыеТипыЗапасов() Экспорт
	
	КонтролируемыеТипыЗапасов = Новый Массив;
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.Товар);
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.КомиссионныйТовар);
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи);
	//++ НЕ УТ
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ПродукцияПереработчика);

	//-- НЕ УТ
	Возврат КонтролируемыеТипыЗапасов;
	
КонецФункции

// Возвращает типы запасов, владельцы которых не содержатся в справочнике Организации.
// 
// Возвращаемое значение:
//  Массив - массив элементов типа ПеречислениеСсылка.ТипыЗапасов
//
Функция ТипыЗапасовВнешнийВладелец() Экспорт
	
	ТипыЗапасовВнешнийВладелец = Новый Массив;
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.КомиссионныйТовар);
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи);
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажиПереданный);
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.АгентскаяУслуга);
	Возврат ТипыЗапасовВнешнийВладелец;
	
КонецФункции

// Возвращает типы запасов, владельцем которых является наша организация.
// 
// Возвращаемое значение:
//  Массив - массив элементов типа ПеречислениеСсылка.ТипыЗапасов
//
Функция ТипыЗапасовСобственные() Экспорт
	
	ТипыЗапасовСобственные = Новый Массив();
	ТипыЗапасовСобственные.Добавить(Перечисления.ТипыЗапасов.Товар);
	ТипыЗапасовСобственные.Добавить(Перечисления.ТипыЗапасов.СобственныйТоварВПути);
	ТипыЗапасовСобственные.Добавить(Перечисления.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке);
	ТипыЗапасовСобственные.Добавить(Перечисления.ТипыЗапасов.Услуга);
	//++ НЕ УТ
	ТипыЗапасовСобственные.Добавить(Перечисления.ТипыЗапасов.ПродукцияПереработчика);
	//-- НЕ УТ
	
	Возврат ТипыЗапасовСобственные;
	
КонецФункции

// Получает представление значения перечисления
//
// Параметры:
//  Значение - ПеречислениеСсылка.ТипыЗапасов 
//  КодЯзыка - Строка - необязательный
// 
// Возвращаемое значение:
//  Строка 
//
Функция ПредставлениеНаЯзыке(Значение, КодЯзыка = Неопределено) Экспорт
	
	Представление = "";
	
	Если Значение = Перечисления.ТипыЗапасов.Товар Тогда
		Представление = НСтр("ru='Собственный товар'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.КомиссионныйТовар Тогда
		Представление = НСтр("ru='Комиссионный товар'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.Услуга Тогда
		Представление = НСтр("ru='Работа (Услуга)'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.МатериалДавальца Тогда
		Представление = НСтр("ru='Материал давальца'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.ПолуфабрикатДавальца Тогда
		Представление = НСтр("ru='Полуфабрикат давальца'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.ПродукцияДавальца Тогда
		Представление = НСтр("ru='Продукция давальца'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.АгентскаяУслуга Тогда
		Представление = НСтр("ru='Агентская услуга'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи Тогда
		Представление = НСтр("ru='Товар на хранении с правом продажи'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.СобственныйТоварВПути Тогда
		Представление = НСтр("ru='Собственный товар в пути'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке Тогда
		Представление = НСтр("ru='Собственный товар по неотфактурованной поставке'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажиПереданный Тогда
		Представление = НСтр("ru='Товар на хранении с правом продажи переданный'", КодЯзыка);
	ИначеЕсли Значение = Перечисления.ТипыЗапасов.ПродукцияПереработчика Тогда
		Представление = НСтр("ru='Продукция переработчика'", КодЯзыка);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции



#КонецОбласти

#КонецЕсли
